
public class OperatorEx15 {
	
	public static void main(String [] args) {
		
		byte a = 12;
		
//		128 64 32 16 8 4 2 1
//		12¿Í °°°Å³ª, ±×·¸Áö ¾ÊÀ¸¸é °¡Àå °¡±î¿î ÀÛÀº ¼ö
//		0   0  0  0  1 1 0 0
//		12-8=4
//		4¿Í °°°Å³ª, ±×·¸Áö ¾ÊÀ¸¸é °¡Àå °¡±î¿î ÀÛÀº ¼ö
//		¡Å4
//		¡Å8+4=12
		
//		
		
		byte b = 20;

//		20¿Í °°°Å³ª, ±×·¸Áö ¾ÊÀ¸¸é °¡Àå °¡±î¿î ÀÛÀº ¼ö
//		128 64 32 16 8 4 2 1
//		0   0  0  1  0 1 0 0
//		20-16=4
//		4¿Í °°°Å³ª, ±×·¸Áö ¾ÊÀ¸¸é °¡Àå °¡±î¿î ÀÛÀº ¼ö
//		¡Å4
//		¡Å16+4=20
		
		byte c = (byte)(a&b);
		
//		128 64 32 16 8 4 2 1
//		0   0  0  0  1 1 0 0
//		0   0  0  1  0 1 0 0
//		0   0  0  0  0 1 0 0 -> 4
		
		System.out.println("a&b : " +c);
		
		byte d = (byte)(a|b);
//		128 64 32 16 8 4 2 1
//		0   0  0  0  1 1 0 0
//		0   0  0  1  0 1 0 0
//		0   0  0  1  1 1 0 0 ->16+8+4=28
		
		System.out.println("a|b : " +d);
		
		byte e = (byte)(a^b);
//		µÑÀÇ °ªÀÌ ´Ù¸£¸é 1ÀÇ °ªÀ» °¡Áø´Ù
//		128 64 32 16 8 4 2 1
//		0   0  0  0  1 1 0 0
//		0   0  0  1  0 1 0 0
//		0   0  0  1  1 0 0 0->16+8=24
		
		System.out.println("a^b : " +e);
		System.out.println("a : " + a);
		System.out.println("b : " + b);
		
		
		
		
		
	}

}
